<a href="https://colab.research.google.com/github/amishali/Anaylsis-of-titanic-dataset-/blob/main/Data_science_with_python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **Titanic dataset (predict whether people survive the titanic or not )**

# Data preparation and  preprocessing

# importing libarires

In [ ]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns

# loading the dataset

In [ ]:
titanic = pd.read_csv('train.csv')
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
titanic.describe() #provide information on the numerical data 

#incase u want to include all the data just type include equal

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

# Data cleaning

####remove dupliactes

In [ ]:
pdtitanic.duplicates().sum()

AttributeError: ignored

In [ ]:
titanic.drop_duplicates(inplace=True) # this function drop any duplicate rows if their is any  
                          #  u can create a different variable to store our new dataset eg titanic_new = titanic.drop_duplicates()
                          #or add the inplace variable incase your want to use the same variable

###missing data

In [ ]:
# missing at random 
#1. we can impute missing data with constant 
# drop all the column and row with missing data ( do this only we necessary since this can lead to loss of information  )

titanic.isnull().sum()

In [ ]:
titanic.isnull().mean()

In [ ]:
#impute age 
titanic['Age'].fillna(titanic['Age'].mean() ,inplace= True) # in this titanic dataset fill the column age
                                                      #with its means and inplace it permanetly there (overwrite the missing value )    
                      # we impute mean for the numerical  data (age is a numerical data )

In [ ]:
#impute embark 
# we use mode since embark is a categorical data 
# lets use the value count to see where most people embarked from 

titanic['Embarked'].value_counts()

In [ ]:
#impute embark
titanic['Embarked'].fillna('s' , inplace = True)

In [ ]:
#drop cabin 
# if a column has more than 50% of its value missing just drop the column 
titanic.drop('cabin' , axis = 1 , inplace= True) # default axis = 0 is for drop if refering to column use axis = 1

In [ ]:
titanic.head()

In [ ]:
#check if the cleaned titanic dataset has a missing value 
titanic.isnull().sum()

###fixing structural Errors

In [ ]:
#round up  the floats and convert it to integers 
titanic['Age'] = np.ceil(titanic['Age'].values).astype(int) # fn np.ceil round up the values in age and convert them to  integer

In [ ]:
titanic['Age'].values

# DATA VISUALIZATION

In [ ]:
# how many people survived the titanic 
titanic['survived'].value_counts()

In [ ]:
# set the figure to visualize 
plt.figure(figsize=(12,8))

#create countplot 
sns.countplot( x = 'survived' , data = titanic , palette = 'husl').set(ylabel = 'no of people ' , title = 'survior value counts')

In [ ]:
# the people who survived and their class distribution
sns.set(rc={'figure.figsize':(12 ,8)})

sns.countplot(x = 'survived' , hue ='Pclass' , data = titanic ,
              palette = 'autumn').set(ylabel = 'no of passangers ' , title = 'survived vs class')

In [ ]:
# the people who survived according to sex 
sns.countplot(x = 'sex' , hue ='survived' , data = titanic ,
              palette = 'inferno').set(ylabel = 'no of passangers ' , title = 'survived vs sex')

In [ ]:
#age distribution

sns.displot(data = titanic , x='Age')

In [ ]:
# age that surived the titanic
sns.displot(data = titanic.loc[titanic['Survived']==1], x= 'Age')